<template>
  <!--START SECTION FAQ-->
  <section class="section s-faq" id="faq">
    <div class="container container--flex">
      <div class="title">Часто задаваемые вопросы</div>
      <CollapseGroup>
        <div class="s-faq__block">
          <Collapse
              title="Нужно ли мне быть дома во время уборки?">
            <p>Многие клиенты остаются дома, когда впервые заказывают уборку на
              WOW SERVICE. Но в следующий раз они предпочитают оставить
              клинера одного, чтобы заниматься своими делами. Для этого есть
              дополнительная услуга «Доставка ключей» — когда уборка будет
              закончена, клинер просто привозит ключи туда, куда удобно клиенту.</p>
          </Collapse>
          <Collapse
              title="У меня раздельный санузел, сколько у меня ванных комнат?">
            <p>В калькуляции мы учитываем только количество полных ванных комнат,
              в которых стоит душевая кабина или ванна. Это значит, что если
              у вас раздельный санузел, а именно: ванная комната и отдельный
              туалет, то вы в процессе оформления заказа должны выбрать одну ванную комнату.</p>
          </Collapse>
          <Collapse
              title="Из чего состоит стандартная уборка?">
            <p>Стандартная уборка - это уборка, поддерживающая Ваш дом в чистоте и порядке.
              И вот из чего стандартная уборка состоит: Жилые комнаты Протираем все
              доступные поверхности, выключатели и дверные ручки; Чистим зеркала и стеклянные
              поверхности; Складываем одежду и расставляем вещи; Застилаем кровать;
              Моем пол, протираем плинтусы и пылесосим ковёр; Убираем мусор. Ванная комната
              и туалет Протираем все доступные поверхности, выключатели и дверные ручки; Моем
              и дезинфицируем унитаз; Моем душевую кабину и ванную; Чистим зеркала и стеклянные
              поверхности; Моем пол, протираем плинтусы и пылесосим коврики; Протираем шкафы
              с внешней стороны; Выносим мусор. Кухня Протираем все доступные поверхности,
              выключатели и дверные ручки; Моем снаружи бытовую технику, кухонный фартук;
              Чистим раковину; Моем пол и протираем плинтусы; Выносим бытовой мусор. Коридор
              Протираем все доступные поверхности; Чистим зеркала и стеклянные поверхности;
              Моем пол, протираем плинтусы и пылесосим коврики; Протираем двери, дверные
              косяки и ручки; Расставляем обувь.</p>
          </Collapse>
        </div>
        <div class="s-faq__block">
          <Collapse
              title="Клинер приезжает с необходимым инвентарем и средствами?">
            <p>Клинер приедет со всем необходимым. Ведра, швабра, салфетки или тряпки
              для очищения поверхностей, губки с абразивной стороной, а также мусорные
              пакеты. Чистящие средства — для ванной, стекла, пола и
              универсальное — мы тоже привозим с собой.</p>
          </Collapse>
          <Collapse
              title="Делаете ли вы уборку после ремонта?">
            <p>Да, мы также специализируемся на уборке после ремонта. Вам только
              требуется выбрать вид уборки "после ремонта" данная услуга стоит
              дороже обычной. Дело в том, что уборка после ремонта сильно отличается
              от простой уборки. Даже если вы уже убрали крупный мусор, остаётся
              много пыли, разводов и пятен от краски, шпатлёвки, лака и так
              далее. Чтобы убрать их, требуется много сил. Также Вы
              можете проконсультироваться по телефону:
              <a href="tel:87778310808" class="link link--gray">+7 777 831 08 08</a>.</p>
          </Collapse>
          <Collapse
              title="Делаете ли вы уборку в частных домах, коттеджах, таунхаусах и на дачах?">
            <p>Да мы выполняем уборку в частных домах, коттеджах и в больших
              особняках. В зависимости от обьема работы прикрепляем необходимое
              количество клинеров для выполнения уборки в течении одного дня.</p>
          </Collapse>
        </div>
      </CollapseGroup>
    </div>
    <div class="s-faq__feedback-link feedback-link">
      Если вы не нашли свой вопрос
      <a href="#"
         @click.prevent="onContactUsClick"
         class="link link--green link--bordered">напишите нам</a>
    </div>
  </section>
  <!--END SECTION FAQ-->
</template>

<script lang="ts">
import { Options, Vue } from 'vue-class-component';
import { Collapse, CollapseGroup } from '@/components/collapse';

@Options({
  components: {
    CollapseGroup,
    Collapse,
  },
  emits: ['contactUsClick'],
})
export default class FaqSection extends Vue {
  onContactUsClick(): void {
    this.$store.dispatch('openModal', 'feedback');
  }
}
</script>
